examples/flows/compiled/async_sequential/flow.mmd
flowchart TD
    %% Flow: llm_auditor_flow

    critic[critic]
    reviser([reviser])
    start_llm_auditor_flow([start_llm_auditor_flow])

    start_llm_auditor_flow --> critic
    critic --> reviser
